cf/DataProcessors/ManagerMonitors.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>ManagerMonitors</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/IncomeAndExpenses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>IncomeAndExpenses</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountIncome</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountExpense</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BusinessActivity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessActivities</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CustomerOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/GLAccountsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>GLAccountsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DepreciationFixedAssets</Name>
					<Comment>02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FixedAssets</Name>
					<Comment>01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsGroup</Name>
					<Comment>Service</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Debitors</Name>
					<Comment>62.01, 60.02, 68.02, 71.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CashAssets</Name>
					<Comment>50, 51, 57</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LongtermObligations</Name>
					<Comment>67</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Incomings</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
					<Comment>10, 41</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Capital</Name>
					<Comment>80</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IndirectExpenses</Name>
					<Comment>25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ShorttermInvestments</Name>
					<Comment>58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Creditors</Name>
					<Comment>60.01, 62.02, 68.01, 70.01, 71.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreditsAndLoans</Name>
					<Comment>66</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProfitTax</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UnfinishedProduction</Name>
					<Comment>20</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UndistributedProfit</Name>
					<Comment>84</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProfitLosses</Name>
					<Comment>99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreditInterestRates</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherFixedAssets</Name>
					<Comment>08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherIncome</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherShorttermObligations</Name>
					<Comment>98</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentAssets</Name>
					<Comment>94, 97</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherExpenses</Name>
					<Comment>91.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expenses</Name>
					<Comment>90.07, 90.08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReserveAndAdditionalCapital</Name>
					<Comment>82</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CostOfGoodsSold</Name>
					<Comment>90.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TradeMarkup</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccountByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessCalendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultVATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileFacsimilePrinting</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeVATInPrice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntityIndividual</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartyKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LogoFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCashByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PettyCashes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationCountry</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.WorldCountries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Region</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/ManagerMonitors/Forms/KPI/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
// Procedure - event handler OnCreateAtServer of the form.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	GetSettings();
	RefreshData();
	
EndProcedure // OnCreateAtServer()

&AtClient
// Procedure - event handler OnClose form.
//
Procedure OnClose()
	
	SaveSettings();
	
EndProcedure // OnClose()

#EndRegion

#Region FormAttributesEventsHandlers

&AtClient
// Procedure - event handler OnChange of the Company input field.
//
Procedure CompanyOnChange(Item)

	RefreshData();
	
EndProcedure // CompanyOnChange()

&AtClient
// Procedure - event  handler OnChange input field Period.
//
Procedure PeriodOnChange(Item)
	
	If Period = '00010101' Then
		Period = CurrentDate();
	EndIf;	
		
	RefreshData();
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure Refresh(Command)
	
	RefreshData();
	
EndProcedure

#EndRegion

#Region CommonUseProceduresAndFunctions

&AtServer
// The procedure restores common monitor settings.
//
Procedure GetSettings()
	
	If Constants.AccountingBySubsidiaryCompany.Get() Then
		Company = Constants.SubsidiaryCompany.Get();
		Items.Company.ReadOnly = True;
	Else
		Company = CommonUse.CommonSettingsStorageImport("SettingsForMonitors", "Company");
		If Not ValueIsFilled(Company) Then
			Company = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainCompany");
			If Not ValueIsFilled(Company) Then
				Company = Catalogs.Companies.MainCompany;
			EndIf;
		EndIf;
	EndIf;
	
	Period = CommonUse.CommonSettingsStorageImport("SettingsForMonitors", "Period");
	If Not ValueIsFilled(Period) Then
		Period = CurrentSessionDate();
	EndIf;
	
EndProcedure // GetSettings()

&AtServer
// The procedure saves common monitor settings.
//
Procedure SaveSettings()
	
	CommonUse.CommonSettingsStorageSave("SettingsForMonitors", "Company", Company);
	
	If (BegOfDay(CurrentSessionDate()) = BegOfDay(Period)) Then
		CommonUse.CommonSettingsStorageSave("SettingsForMonitors", "Period", '00010101');
	Else
		CommonUse.CommonSettingsStorageSave("SettingsForMonitors", "Period", Period);
	EndIf;

EndProcedure // SaveSettings()

&AtServer
// The procedure updates the form data.
//
Procedure RefreshData()
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	AccountingIncomeAndCosts.Period AS Period,
	|	AccountingIncomeAndCosts.AmountIncomeTurnover AS Income,
	|	0 AS Cost,
	|	0 AS Expenses
	|FROM
	|	AccumulationRegister.IncomeAndExpenses.Turnovers(
	|			&FilterDateBeginning,
	|			&FilterDateEnds,
	|			Month,
	|			Company = &Company
	|				AND GLAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Incomings)) AS AccountingIncomeAndCosts
	|
	|UNION ALL
	|
	|SELECT
	|	AccountingIncomeAndCosts.Period,
	|	0,
	|	AccountingIncomeAndCosts.AmountExpenseTurnover,
	|	0
	|FROM
	|	AccumulationRegister.IncomeAndExpenses.Turnovers(
	|			&FilterDateBeginning,
	|			&FilterDateEnds,
	|			Month,
	|			Company = &Company
	|				AND GLAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.CostOfGoodsSold)) AS AccountingIncomeAndCosts
	|
	|UNION ALL
	|
	|SELECT
	|	AccountingIncomeAndCosts.Period,
	|	0,
	|	0,
	|	AccountingIncomeAndCosts.AmountExpenseTurnover
	|FROM
	|	AccumulationRegister.IncomeAndExpenses.Turnovers(
	|			&FilterDateBeginning,
	|			&FilterDateEnds,
	|			Month,
	|			Company = &Company
	|				AND GLAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.Expenses)) AS AccountingIncomeAndCosts
	|
	|ORDER BY
	|	Period
	|TOTALS
	|	SUM(Income),
	|	SUM(Cost),
	|	SUM(Expenses)
	|BY
	|	Period PERIODS(MONTH, &FilterDateBeginning, &FilterDateEnds)";
	
	Query.SetParameter("FilterDateBeginning", AddMonth(EndOfMonth(Period)+1,-12));
	Query.SetParameter("FilterDateEnds", EndOfMonth(Period));
	Query.SetParameter("Company", Company);
	
	QueryResult = Query.Execute();
	
	MaxIncome = 0;
	MaxCost = 0;
	MaxGrossProfit = 0;
	MaxExpenses = 0;
	MaxProfit = 0;
	Selection = QueryResult.Select(QueryResultIteration.ByGroups);
	While Selection.Next() Do
		If Selection.Income > MaxIncome Then
			MaxIncome = Selection.Income;
		EndIf;
		If Selection.Cost > MaxCost Then
			MaxCost = Selection.Cost;
		EndIf;
		If Selection.Income - Selection.Cost > MaxGrossProfit Then
			MaxGrossProfit = Selection.Income - Selection.Cost;
		EndIf;
		If Selection.Expenses > MaxExpenses Then
			MaxExpenses = Selection.Expenses;
		EndIf;
		If Selection.Income - Selection.Cost - Selection.Expenses > MaxProfit Then
			MaxProfit = Selection.Income - Selection.Cost - Selection.Expenses;
		EndIf;
	EndDo;
	
	Selection = Query.Execute().Select(QueryResultIteration.ByGroups, "Period", "All");
	MonthNumber = 0;
	While Selection.Next() Do
		
		MonthNumber = MonthNumber + 1;
		
		Income = ?(ValueIsFilled(Selection.Income), Selection.Income, 0);
		Cost = ?(ValueIsFilled(Selection.Cost), Selection.Cost, 0);
		GrossProfit = Income - Cost;
		Expenses = ?(ValueIsFilled(Selection.Expenses), Selection.Expenses, 0);
		Profit = Income - Cost - Expenses;
		
		Items["Month"+MonthNumber].Title = Format(Selection.Period, "DF='MMMM yyyy'");
		
		Items["Income"+MonthNumber].Title = FormattedStringForChart(Income, MaxIncome, SmallBusinessServer.ColorForMonitors("Green"));
		Items["Cost"+MonthNumber].Title = FormattedStringForChart(Cost, MaxCost, SmallBusinessServer.ColorForMonitors("Blue"));
		Items["GrossProfit"+MonthNumber].Title = FormattedStringForChart(GrossProfit, MaxGrossProfit, SmallBusinessServer.ColorForMonitors("Coral"));
		Items["Expenses"+MonthNumber].Title = FormattedStringForChart(Expenses, MaxExpenses, SmallBusinessServer.ColorForMonitors("Orange"));
		Items["Profit"+MonthNumber].Title = FormattedStringForChart(Profit, MaxProfit, SmallBusinessServer.ColorForMonitors("Magenta"));
		
	EndDo;
	
EndProcedure

// The function returns a formatted string for the form item as a chart (horizontal stacked chart) with a signature
//
// Parameters:
//  CurrentValue	 - Number	 - series
//  MaxValue value	 - Number	 - maximum value for
//  the ValueColor chart	 - Color	 - Color
// for series Return value:
//  FormattedString
&AtServerNoContext
Function FormattedStringForChart(CurrentValue, MaxValue, ValueColor)
	
	CharactersInChart = 16;
	EmptyValueColor = SmallBusinessServer.ColorForMonitors("Light-gray");
	
	RowItems = New Array;
	ItemChartValue = New Structure("String, Font, TextColor");
	ChartLine = "";
	
	If CurrentValue < 0 Or MaxValue <= 0 Then
		CurrentValueCharacters = 0;
	Else
		CurrentValueCharacters = ?(MaxValue = 0, 0, Round(CurrentValue / MaxValue * CharactersInChart));
	EndIf;
	For IndexOf = 1 To CurrentValueCharacters Do
		ChartLine = ChartLine + "▄";
	EndDo;
	ItemChartValue.String = ChartLine;
	ItemChartValue.Font = New Font("@Arial Unicode MS");
	ItemChartValue.TextColor = ValueColor;
	
	RowItems.Add(ItemChartValue);
	
	ItemEmptyValueCharts = New Structure("String, Font, TextColor");
	ChartLine = "";
	
	For IndexOf = CurrentValueCharacters+1 To CharactersInChart Do
		ChartLine = ChartLine + "▄";
	EndDo;
	ChartLine = ChartLine + Chars.LF;
	ItemEmptyValueCharts.String = ChartLine;
	ItemEmptyValueCharts.Font = New Font("@Arial Unicode MS");
	ItemEmptyValueCharts.TextColor = EmptyValueColor;
	RowItems.Add(ItemEmptyValueCharts);
	
	ItemValuePresentation = New Structure("String, Font, TextColor");
	
	ItemValuePresentation.String = Format(CurrentValue, "NFD=2; NGS=' '; NZ=0,00; NG=3,0");
	If CurrentValue < 0 Then
		ItemValuePresentation.TextColor = SmallBusinessServer.ColorForMonitors("Red");
	Else
		ItemValuePresentation.TextColor = SmallBusinessServer.ColorForMonitors("Gray");
	EndIf;
	RowItems.Add(ItemValuePresentation);
	
	Return SmallBusinessServer.BuildFormattedString(RowItems);
	
EndFunction

#EndRegion
